# Sframes tutorial
Editing the first tutorial to use pandas

In [1]:
import pandas

In [2]:
df = pandas.read_csv('people-example.csv')

In [3]:
df.head()

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [10]:
df['Country'].unique()

array(['United States', 'Canada', 'England', 'Poland', 'Switzerland'], dtype=object)

In [9]:
df['Country'] = df['Country'].apply(transform_country)
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown  United States   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

## Alternatives to GraphLab Canvas
Still searching for an option but while attempting to recreate calculations and graphs using pandas and matplotlib

In [15]:
df['age'].value_counts(normalize=True)

23    0.428571
22    0.285714
25    0.142857
24    0.142857
Name: age, dtype: float64

## Inspect dataset columns

In [17]:
df.Country

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [18]:
df.age

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64

In [20]:
df.age.mean()

23.142857142857142

In [21]:
df.age.max()

25

## Create new dataframe columns

In [22]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown  United States   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [23]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [24]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

## Use the apply function to do an advanced transformation of the data

In [6]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [7]:
df['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object